In [2]:
import numpy as np
import pandas as pd

In [125]:
class MyClass:
    classvar = 'myclass'
    def __init__(self,name,seed):
        self.__seed = seed
        self.__name = name
        self._duplicatename = name
        self.publicname = name
        print('created')
        
    @property
    def name(self):
        return self.__name
    
    @name.setter
    def name(self,newname):
        if len(newname)>3:
            self.__name = newname
        else:
            print('very small name')
        
    @name.deleter
    def name(self):
        del self.__name
        print('deleted')
        
    @classmethod
    def classmtd(cls):
        print('its class method '+ cls.classvar)
        
    @staticmethod
    def staticmtd(arg):
        print('its static method')
        
    def __add__(self,clsobj):
        return 2 ** (self.__seed + clsobj.__seed)

In [126]:
obj1 = MyClass('John',1)
obj2 = MyClass('John',2)
obj1+obj2

created
created

8

In [135]:
def myfun(ele,lst=[]):
    lst.append(ele)
    return lst

In [138]:
def myfunnew(ele,lst=None):
    if lst is None:
        lst = []
    lst.append(ele)
    return lst

In [148]:
def myargs(*args,**kwargs):
    lst=[]
    for k in args:
        lst.append(k)
    for key,value in kwargs.items():
        print(key,value)
    return lst

In [153]:
area = lambda x: x*x

In [164]:
df = pd.DataFrame?

In [250]:
df1 = pd.DataFrame(data=[[10,5],[20,10],[30,15],[40,20]],columns=['A','B'])

In [251]:
df2 = pd.DataFrame(data=[[1,2],[2,3],[3,4],[4,5]],columns=['C','D'])

In [256]:
df1.join(df2)

    A   B  C  D
0  10   5  1  2
1  20  10  2  3
2  30  15  3  4
3  40  20  4  5

In [259]:
df1.merge(df2,left_on='B',right_on='D')

    A  B  C  D
0  10  5  4  5

In [262]:
pd.concat([df1,df2],axis=0)

      A     B    C    D
0  10.0   5.0  NaN  NaN
1  20.0  10.0  NaN  NaN
2  30.0  15.0  NaN  NaN
3  40.0  20.0  NaN  NaN
0   NaN   NaN  1.0  2.0
1   NaN   NaN  2.0  3.0
2   NaN   NaN  3.0  4.0
3   NaN   NaN  4.0  5.0

In [270]:
df1['class']=[1,1,3,4]
df1.groupby(['class']).first()

        A   B
class
1      10   5
3      30  15
4      40  20

In [271]:
df1

    A   B  class
0  10   5      1
1  20  10      1
2  30  15      3
3  40  20      4